Catalogs/ВидыЛицензии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ВидыЛицензии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Информировать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Правила</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеализации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРеализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Лицензии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Лицензии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЛицензии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицензии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщийМодульСервер/Ext/Module.bsl
Функция ПолучитьПараметрыСеанса() Экспорт
	Результат = Новый Структура;
	
	Для Каждого Параметр Из Метаданные.ПараметрыСеанса Цикл
		Результат.Вставить(Параметр.Имя, ПараметрыСеанса[Параметр.Имя]);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьЗначениеРеквизита(Объект, Реквизит, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Значение = Объект[Реквизит];
	Возврат ?(ЗначениеЗаполнено(Значение), Значение, ЗначениеПоУмолчанию);
КонецФункции

Функция ПолучитьЗначениеКонстанты(Константа, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Значение = Константы[Константа].Получить();
	Возврат ?(ЗначениеЗаполнено(Значение), Значение, ЗначениеПоУмолчанию);
КонецФункции

Функция ПроверитьЛицензию(Дата, Контрагент, ВидРеализации, Организация) Экспорт
	Результат = Истина;
	
	Правила = Справочники.ВидыЛицензии.ПолучитьПравила(Организация, ВидРеализации);
	Если Правила.Количество() > 0 Тогда
		Для Каждого Правило Из Правила Цикл
			Результат = Ложь;
			
			Выборка = Справочники.Лицензии.Выбрать(,Контрагент,Новый Структура("ВидЛицензии", Правило));
			Пока Выборка.Следующий() Цикл
				Если Выборка.Срок >= Дата Тогда
					Результат = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Результат = Ложь Тогда
				Сообщить("У выбранного контрагента не обнаружена действующая лицензия: """ + Правило.Наименование + """");
				
				Возврат Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПроверитьПраваДоступа(Знач Источник) Экспорт
	ТекущийПользовательСистемы = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ТекущийПользовательСистемы.Роли.Содержит(Метаданные.Роли.Администратор) = Ложь Тогда
		Если Источник.Автор <> ПараметрыСеанса.Пользователь Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ПолучитьМоментВремениДокумента(Знач Источник) Экспорт
	Если Источник.Проведен Тогда
		Возврат Новый Граница(Новый МоментВремени(Источник.Дата, Источник.Ссылка), ВидГраницы.Исключая);
	Иначе
		Возврат Новый Граница(Новый МоментВремени(Источник.Дата, Источник.Ссылка), ВидГраницы.Включая);
	КонецЕсли;
КонецФункции

Функция ПолучитьПериодКакМассив(НачПериода, КонПериода) Экспорт
	Список = Новый СписокЗначений;
	
	ТекДата = КонецДня(НачПериода);
    Пока ТекДата < КонецДня(КонПериода) Цикл
    	Список.Добавить(ТекДата);
		
		ТекДата = ТекДата + 60 * 60 * 24; 	
	КонецЦикла;
	
	Список.Добавить(ТекДата);
	
	Возврат Список;
КонецФункции

Функция ПолучитьКоличествоМесяцевМеждуДатами(ДатаНачала, ДатаКонца) Экспорт
    МесяцНачала = Месяц(ДатаНачала);
	МесяцКонца = Месяц(ДатаКонца);
	ЛетМеждуДатами = Год(ДатаКонца) - Год(ДатаНачала);
	РезультатВМесяцах = ЛетМеждуДатами * 12 - МесяцНачала + МесяцКонца;
	Возврат РезультатВМесяцах + 1;
КонецФункции
